#+title: Creating A Webapp and Refining Agent Processes with Langchain and Langgraph
#+author: ChiefKemist
#+date: <2024-08-05 Mon>


*** Render FastHTML to string


#+begin_src python :results output

from fasthtml.common import to_xml
from fasthtml import P, Div, Article

comp = to_xml(Article(Div("Lambert!", P("Rigobert"))))

print(comp)

#+end_src

#+RESULTS:
: <article>
:   <div>
: Lambert!
:     <p>Rigobert</p>
:   </div>
: </article>
:

**** SSE Message

#+begin_src python :results output

from fasthtml.common import to_xml
from fasthtml import Div

def render_sse_html_chunk(event: str, id: str, chunk: str) -> bytes:
    return f"""
event: {event}
data: {to_xml(Div(chunk, id=id, hx_swap_oob='true'))}\n\n
""".encode("utf-8")

sse_msg = render_sse_html_chunk("SomeEvent", "SomeID", "Chunk (string or html string or whatever data as string)")

print(sse_msg)

#+end_src

#+RESULTS:
: b'\nevent: SomeEvent\ndata: <div hx-swap-oob="true" id="SomeID">Chunk (string or html string or whatever data as string)</div>\n\n\n\n'

